; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v7)
		(pred_4 ?v8)
		(pred_2 ?v1)
		(pred_1 ?v1)
		(pred_5 ?v8 ?v1)
		(pred_3)
		(pred_6 ?v8))

   (:action op_1
       :parameters  (?v6 ?v4)
       :precondition (and (not-eq ?v6 ?v4) 
                          (pred_2 ?v6) (pred_2 ?v4) (pred_1 ?v6))
       :effect (and  (pred_1 ?v4)
		     (not (pred_1 ?v6))))


   (:action op_3
       :parameters (?v2 ?v3)
       :precondition  (and  (pred_4 ?v2) (pred_2 ?v3)
			    (pred_5 ?v2 ?v3) (pred_1 ?v3) (pred_3))
       :effect (and (pred_6 ?v2)
		    (not (pred_5 ?v2 ?v3)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v2  ?v3)
       :precondition  (and  (pred_4 ?v2) (pred_2 ?v3)
			    (pred_6 ?v2) (pred_1 ?v3))
       :effect (and (pred_5 ?v2 ?v3)
		    (pred_3)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_02 obj_05 obj_09 obj_08 obj_01 obj_03 
          obj_07 obj_06 obj_04 
)
(:init
(pred_2 obj_02)
(pred_2 obj_05)
(pred_2 obj_09)
(pred_2 obj_08)
(pred_2 obj_01)
(pred_2 obj_03)
(pred_4 obj_07)
(pred_4 obj_06)
(pred_4 obj_04)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_3)
(pred_5 obj_07 obj_05)
(pred_5 obj_06 obj_05)
(pred_5 obj_04 obj_08)
(pred_1 obj_08)
)
(:goal
(and
(pred_5 obj_07 obj_02)
(pred_5 obj_06 obj_08)
(pred_5 obj_04 obj_08)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_07 obj_02) (pred_1 obj_09))
    (sometime-before  (pred_5 obj_06 obj_08) (pred_1 obj_02))
  )
)
)

; plan
1. (op_1 obj_08 obj_05)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_05)
   goals met: 1 of 3
2. (op_3 obj_07 obj_05)
   deleted: (pred_5 obj_07 obj_05) (pred_3)
   added: (pred_6 obj_07)
   goals met: 1 of 3
3. (op_1 obj_05 obj_08)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_08)
   goals met: 1 of 3
4. (op_2 obj_07 obj_08)
   deleted: (pred_6 obj_07)
   added: (pred_5 obj_07 obj_08) (pred_3)
   goals met: 1 of 3
5. (op_1 obj_08 obj_05)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_05)
   goals met: 1 of 3
6. (op_3 obj_06 obj_05)
   deleted: (pred_5 obj_06 obj_05) (pred_3)
   added: (pred_6 obj_06)
   goals met: 1 of 3
7. (op_1 obj_05 obj_09)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_09)
   goals met: 1 of 3
8. (op_2 obj_06 obj_09)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_09) (pred_3)
   goals met: 1 of 3
9. (op_1 obj_09 obj_08)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_08)
   goals met: 1 of 3
10. (op_3 obj_07 obj_08)
   deleted: (pred_5 obj_07 obj_08) (pred_3)
   added: (pred_6 obj_07)
   goals met: 1 of 3
11. (op_1 obj_08 obj_02)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_02)
   goals met: 1 of 3
12. (op_2 obj_07 obj_02)
   deleted: (pred_6 obj_07)
   added: (pred_5 obj_07 obj_02) (pred_3)
   goals met: 2 of 3
13. (op_1 obj_02 obj_09)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_09)
   goals met: 2 of 3
14. (op_3 obj_06 obj_09)
   deleted: (pred_5 obj_06 obj_09) (pred_3)
   added: (pred_6 obj_06)
   goals met: 2 of 3
15. (op_1 obj_09 obj_08)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_08)
   goals met: 2 of 3
16. (op_2 obj_06 obj_08)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_08) (pred_3)
   goals met: 3 of 3
